Repository: yusixian/hole
Catalog: Hole/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# onboarding.ai.body
source: AI lives quietly here. After you write, a small echo appears — never a notification, never a popup. You can turn it off in settings any time.
zh_hans: AI 在这里只是轻轻陪着你。写完后会有一段小回声，没有通知，没有弹窗。设置里随时可以关闭。

# onboarding.ai.title
source: A gentle AI
zh_hans: 温和的 AI

# onboarding.back
source: Back
zh_hans: 上一步

# onboarding.features.body
source: Write text, record voice, attach photos. Mark anything as private and it skips AI entirely. The journal is the point — AI is just plus.
zh_hans: 写下文字、录段语音、贴张照片。任何条目可标记为私密，完全跳过 AI。日记本身才是核心，AI 只是加分项。

# onboarding.features.title
source: A private journal
zh_hans: 一本私密的日记

# onboarding.next
source: Next
zh_hans: 下一步

# onboarding.privacy.body
source: All entries stay on this device. No analytics, no behavioural tracking. Only crash diagnostics via MetricKit, and you can turn that off too. Your data is yours, fully exportable.
zh_hans: 所有内容都留在这台设备。不接行为统计，仅通过 MetricKit 收集崩溃诊断，可关闭。你的数据属于你，可随时导出。

# onboarding.privacy.title
source: Yours, only yours
zh_hans: 只属于你

# onboarding.setup.appLock
source: Lock with Face ID
zh_hans: 用 Face ID 锁定

# onboarding.setup.appLock.hint
source: Hole will require biometric unlock when reopened.
zh_hans: 重新打开时需要 Face ID 解锁。

# onboarding.setup.body
source: Pick the persona that will leave a small echo after each entry. You can change everything later in Settings.
zh_hans: 选择一个会在你写完后留下回声的人格。任何选择都可以稍后在设置里更改。

# onboarding.setup.persona
source: Default persona
zh_hans: 默认人格

# onboarding.setup.title
source: Just one moment
zh_hans: 最后一步

# onboarding.start
source: Start
zh_hans: 开始

# onboarding.welcome.body
source: A small place to talk to yourself, kept just on this phone, gently held by AI.
zh_hans: 和自己说话的小角落。完全留在这部手机上，由 AI 轻轻陪伴。

# onboarding.welcome.title
source: Welcome to Hole
zh_hans: 欢迎来到 Hole

# intent.param.body
source: Body
zh_hans: 正文

# intent.param.count
source: Count
zh_hans: 条数

# intent.param.mood
source: Mood (1-5)
zh_hans: 心情 (1-5)

# intent.param.query
source: Query
zh_hans: 关键词

# intent.param.tags
source: Tags
zh_hans: 标签

# intent.recent.description
source: Read your most recent Hole entries.
zh_hans: 读取你最近的 Hole 条目。

# intent.recent.title
source: Read recent Hole entries
zh_hans: 读取最近的 Hole 条目

# intent.search.description
source: Search Hole entries by keyword.
zh_hans: 按关键词搜索 Hole 条目。

# intent.search.title
source: Search Hole entries
zh_hans: 搜索 Hole 条目

# intent.streak.description
source: Get your current Hole writing streak in days.
zh_hans: 获取你 Hole 当前的连续写作天数。

# intent.streak.title
source: Hole writing streak
zh_hans: Hole 连续天数

# intent.write.description
source: Add a new entry to your Hole.
zh_hans: 在 Hole 中新增一条记录。

# intent.write.title
source: Write a Hole entry
zh_hans: 写一条 Hole

# export.action
source: Generate file
zh_hans: 生成文件

# export.format
source: Format
zh_hans: 格式

# export.includePrivate
source: Include private entries
zh_hans: 包含私密条目

# export.includePrivate.hint
source: Encrypted blobs are skipped; bodies are exported only when readable.
zh_hans: 加密内容会跳过，仅导出可读条目。

# export.nav
source: Export
zh_hans: 导出

# export.options
source: Options
zh_hans: 选项

# export.share
source: Share %@
zh_hans: 分享 %@

# settings.export.entry
source: Export entries
zh_hans: 导出条目

# settings.section.data
source: Data
zh_hans: 数据

# settings.section.stats
source: Stats
zh_hans: 统计

# settings.stats.entry
source: Open stats
zh_hans: 查看统计

# stats.aiUsage
source: AI usage
zh_hans: AI 用量

# stats.entries.unit
source: entries
zh_hans: 条

# stats.monthMood
source: This month’s mood
zh_hans: 本月情绪曲线

# stats.nav
source: Stats
zh_hans: 统计

# stats.streak
source: Writing streak
zh_hans: 连续天数

# stats.streak.unit
source: days in a row
zh_hans: 天连续

# stats.thisMonth
source: This month
zh_hans: 本月

# stats.usage.autoTag
source: Auto-tagging
zh_hans: 自动标签

# stats.usage.chat
source: Chat
zh_hans: 对话

# stats.usage.echo
source: Write echo
zh_hans: 写后回声

# stats.usage.summary
source: Summary
zh_hans: 摘要

# applock.reason
source: Unlock Hole
zh_hans: 解锁 Hole

# applock.subtitle
source: Authenticate to keep your hole private.
zh_hans: 解锁后才能查看你的树洞。

# applock.title
source: Hole is locked
zh_hans: Hole 已上锁

# applock.unlock
source: Unlock
zh_hans: 解锁

# settings.appLock.unavailable
source: Face ID / passcode unavailable on this device
zh_hans: 此设备未配置 Face ID 或密码

# settings.vault.entries
source: Private locker
zh_hans: 私密保险箱

# settings.vault.reset
source: Reset vault (cannot recover entries)
zh_hans: 重置保险箱（条目无法恢复）

# settings.vault.setup
source: Set up vault PIN
zh_hans: 设置保险箱 PIN

# vault.entries.empty
source: Empty vault
zh_hans: 保险箱空空

# vault.entries.empty.hint
source: Mark an entry as private to add it here.
zh_hans: 把条目设为私密即可放进这里。

# vault.entries.locked
source: Vault is locked
zh_hans: 保险箱已锁

# vault.entries.nav
source: Vault
zh_hans: 保险箱

# vault.lock.action
source: Lock
zh_hans: 锁定

# vault.pin.confirm
source: Confirm PIN
zh_hans: 再次输入 PIN

# vault.pin.new
source: New PIN
zh_hans: 新 PIN

# vault.setup.nav
source: Set up vault
zh_hans: 设置保险箱

# vault.setup.title
source: Set a vault PIN
zh_hans: 设置保险箱 PIN

# vault.setup.warning
source: Your private entries are encrypted with this PIN. If you forget it, your entries cannot be recovered. Hole never stores or syncs the PIN.
zh_hans: 私密条目用此 PIN 加密。一旦遗忘无法恢复，Hole 也不会同步或保存这个 PIN。

# vault.state.locked
source: Locked
zh_hans: 已锁

# vault.state.unlocked
source: Unlocked
zh_hans: 已开

# vault.unlock.action
source: Unlock
zh_hans: 解锁

# vault.unlock.nav
source: Unlock vault
zh_hans: 解锁保险箱

# vault.unlock.subtitle
source: Enter your vault PIN to read private entries.
zh_hans: 输入保险箱 PIN 才能阅读私密条目。

# vault.unlock.title
source: Unlock vault
zh_hans: 解锁保险箱

# ai.echo.loading
source: Echo · listening
zh_hans: 回声 · 倾听中

source: AI suggestions
zh_hans: AI 建议

# ai.suggestion.mood
source: Suggested mood: %@
zh_hans: 建议心情：%@

# settings.ai.echo
source: AI echo after writing
zh_hans: 写后 AI 回声

# settings.ai.echo.hint
source: Local model. Skipped on private entries.
zh_hans: 本地模型，私密条目跳过。

# settings.ai.persona
source: Persona
zh_hans: 人格

# ai.echo.persona.default
source: Listener
zh_hans: 倾听者

source: Appearance
zh_hans: 外观

# appearance.light
source: Light
zh_hans: 浅色

# appearance.dark
source: Dark
zh_hans: 深色

# common.cancel
source: Cancel
zh_hans: 取消

# common.delete
source: Delete
zh_hans: 删除

# common.done
source: Done
zh_hans: 完成

# common.edit
source: Edit
zh_hans: 编辑

# common.save
source: Save
zh_hans: 保存

# compose.addPhoto
source: Photo
zh_hans: 图片

# compose.attachments
source: Attachments
zh_hans: 附件

# compose.record
source: Record
zh_hans: 录音

# compose.body.placeholder
source: Whisper into the hole…
zh_hans: 悄悄对树洞说点什么…

# compose.mood
source: Mood
zh_hans: 心情

# compose.private
source: Mark as private (skip AI)
zh_hans: 标记为私密（不参与 AI）

# compose.privacy
source: Privacy
zh_hans: 隐私

# compose.tags
source: Tags
zh_hans: 标签

# compose.title.edit
source: Edit entry
zh_hans: 编辑条目

# compose.title.new
source: New entry
zh_hans: 新条目

# entry.delete.confirm
source: Delete this entry?
zh_hans: 确认删除这条记录？

# entry.private.banner
source: Private · skipped by AI
zh_hans: 私密 · AI 已跳过

# tag.input.placeholder
source: + tag
zh_hans: + 标签

# masthead.section
source: Hole · Daily
zh_hans: 树洞 · 每日

# mood.veryLow
source: Very low
zh_hans: 很低落

# mood.low
source: Low
zh_hans: 低落

# mood.neutral
source: Neutral
zh_hans: 平和

# mood.good
source: Good
zh_hans: 舒畅

# mood.veryGood
source: Very good
zh_hans: 很好

# persona.listener.name
source: Listener
zh_hans: 倾听者

# persona.warmFriend.name
source: Warm Friend
zh_hans: 暖友

# persona.wiseMentor.name
source: Wise Mentor
zh_hans: 智慧导师

# persona.mirror.name
source: Mirror
zh_hans: 反思镜子

# settings.about.tagline
source: A local-first, AI-augmented private journal for your inner voice.
zh_hans: 本地优先、AI 陪伴的私密树洞日记。

# settings.appLock
source: App lock (Face ID)
zh_hans: 应用锁（Face ID）

# settings.mode
source: Mode
zh_hans: 模式

# settings.mode.auto
source: Auto
zh_hans: 自动

# settings.mode.light
source: Light
zh_hans: 浅色

# settings.mode.dark
source: Dark
zh_hans: 深色

# settings.notConfigured
source: Not set
zh_hans: 未设置

# settings.section.about
source: About
zh_hans: 关于

# settings.section.appearance
source: Appearance
zh_hans: 外观

# settings.section.privacy
source: Privacy
zh_hans: 隐私

# settings.theme
source: Theme
zh_hans: 主题

# settings.vault
source: Vault password
zh_hans: 私密密码

# search.empty.hint
source: Search by keyword, mood, or tag.
zh_hans: 可按关键词、心情或标签搜索。

# search.empty.idle
source: Search your hole
zh_hans: 搜索你的树洞

# search.empty.noMatch
source: No matches
zh_hans: 暂无匹配

# search.placeholder
source: Search…
zh_hans: 搜索…

# search.title
source: Search
zh_hans: 搜索

# tab.calendar
source: Calendar
zh_hans: 日历

# tab.settings
source: Settings
zh_hans: 设置

# tab.timeline
source: Timeline
zh_hans: 时间线

# tab.today
source: Today
zh_hans: 今日

# theme.default.dark
source: Default · Dark
zh_hans: 默认 · 深

# theme.default.light
source: Default · Light
zh_hans: 默认 · 浅

# theme.linen.dark
source: Linen · Dark
zh_hans: 亚麻 · 深

# theme.linen.light
source: Linen · Light
zh_hans: 亚麻 · 浅

# theme.newsprint.dark
source: Newsprint · Dark
zh_hans: 报纸 · 深

# theme.newsprint.light
source: Newsprint · Light
zh_hans: 报纸 · 浅

# theme.nightInk
source: Night Ink
zh_hans: 夜墨

# theme.washi.dark
source: Washi · Dark
zh_hans: 和纸 · 深

# theme.washi.light
source: Washi · Light
zh_hans: 和纸 · 浅

# timeline.empty.subtitle
source: Your timeline will fill in as you write.
zh_hans: 写下第一段心事，时间线就会慢慢填满。

# timeline.empty.title
source: An empty page
zh_hans: 尚未落笔

# timeline.group.today
source: Today
zh_hans: 今天

# timeline.group.yesterday
source: Yesterday
zh_hans: 昨天

# timeline.weekMood
source: This week
zh_hans: 本周心情

# today.action.photo
source: Photo
zh_hans: 照片

# today.action.voice
source: Voice
zh_hans: 录音

# today.action.write
source: Write
zh_hans: 写下

# today.empty.subtitle
source: What do you want to whisper into the hole?
zh_hans: 今天有什么想悄悄说给树洞？

# today.empty.title
source: A blank page
zh_hans: 今天还是白纸

# today.section
source: Today
zh_hans: 今日
